Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/personal_finance/debt/personal_insolvency/personal_insolvency_arrangements.html.txt.tmx
Source language: en
Languages: ga

source: There will be an onus on you to be transparent in relation to all historical pension contributions and the PIP will review these
ga: Beidh dliteanas ort bheith trédhearcach maidir le gach ranníocaíocht stairiúil phinsin agus déanfaidh an CDP athbhreithniú orthu siúd

source: If a creditor or your PIP considers that you have made excessive pension contributions in the 3 years before applying for a PIA, an application can be made to the court to recover these contributions for distribution to your creditors
ga: Má mheasann creidiúnaí nó do CDP go ndearna tú an iomad ranníocaíochtaí pinsin sna 3 bliana sula ndearna tú iarratas ar SDP, féadtar iarratas a dhéanamh ar an gcúirt chun na ranníocaíochtaí seo a aisghabháil lena leithdháileadh chuig do chuid creidiúnaithe

source: While the PIA is in effect, you may not get credit for any amount over €650 without informing the lender that you have a PIA
ga: Fad a bhíonn an SDP i bhfeidhm, féadfaidh tú sochar a fháil d’aon suim os cionn €650 gan an t-iasachtóir a chur ar an eolas go bhfuil SDP agat

source: You may not sell or deal in property above a certain value, except in accordance with the terms of the PIA
ga: Ní féidir leat maoin os cionn luach áirithe a dhíol nó a thrádáil, seachas i gcomhréir le téarmaí an SDP

source: However, no such restriction is placed on your spouse or civil partner
ga: Ní leagtar a shamhail de shrian ar do chéile nó do pháirtnéir sibhialta, áfach

source: You must make your proposal for a PIA through a Personal Insolvency Practitioner (PIP)
ga: Ní mór duit do thogra le haghaidh SDP a dhéanamh trí Chleachtóir um Dhócmhainneacht Phearsanta (CDP)

source: This is a professional who is authorised by the Insolvency Service of Ireland (ISI) and will act on your behalf throughout the Personal Insolvency Arrangement
ga: Seo duine gairmiúil a fuair údarú ó Sheirbhís Dócmhainneachta na hÉireann (SDÉ) agus a ghníomhóidh ar do shon ó thús go deireadh an tSocraithe um Dhócmhainneacht Phearsanta

source: The ISI has developed standard protocols for use by PIPs when making straightforward proposals to creditors for a PIA or a Debt Settlement Arrangement
ga: Tá prótacal caighdeánach forbartha ag an ISI lena úsáid ag PIPanna agus tograí furasta á ndéanamh acu do chreidiúnaithe le haghaidh SDP nó Shocrú um Réiteach Fiachais

source: You must disclose all details of your financial affairs to the PIP, who will then advise you whether or not you meet the conditions for a PIA, the consequences, any alternative options, and the fees that you may have to pay
ga: Ní mór duit gach sonra faoi do chuid gnóthaí airgeadais a nochtadh don CDP, a chuirfidh comhairle ansin ort cibé acu an gcomhlíonann nó nach gcomhlíonann tú na coinníollacha le haghaidh SDP, na hiarmhairtí, aon roghanna eile, agus na táillí a d’fhéadfadh bheith ort a íoc

source: You must act in good faith and co-operate fully with the process
ga: Ní mór duit gníomhú le hintinn mhaith agus comhoibriú go hiomlán leis an bpróiseas

source: The PIP will help you complete a Prescribed Financial Statement as part of your application, giving full and honest information about your financial circumstances
ga: Cabhróidh an CDP leat Ráiteas Forordaithe Airgeadais a chomhlánú mar chuid de d’iarratas, ina dtugtar faisnéis iomlán agus ionraic faoi do chuid cúinsí airgeadais

source: You must also make a declaration that you have been unable to agree an alternative repayment arrangement with your creditor(s) or that your creditor(s) have confirmed in writing that they are unwilling to enter into an alternative repayment arrangement in respect of your principal private residence
ga: Ina theannta sin, ní mór duit dearbhú a dhéanamh nach raibh tú in ann socrú eile aisíocaíochta a chomhaontú le do chreidiúnaí/chreidiúnaithe nó gur dhearbhaigh do chreidiúnaí/chreidiúnaithe i scríbhinn nach bhfuil siad toilteanach iontráil i socrú aisíocaíochta eile leat maidir le do phríomháit chónaithe

source: See ‘Mortgage arrears on your home’ above for specific rules about mortgage debt
ga: Féach ‘Riaráistí morgáiste ar do theach’ thuas chun teacht ar rialacha sonracha faoi fhiachas morgáiste

source: You will have to give your written consent to enable:
ga: Beidh ort do thoiliú i scríbhinn a thabhairt chun an méid a leanas a chur ar bun:

source: • The PIP to disclose your personal data to the ISI
ga: • Go nochtfaidh an CDP do shonraí pearsanta do SDÉ

source: • The ISI to process your application
ga: • Go bpróiseálfaidh SDÉ d’iarratas

source: • The ISI to make any necessary enquiries about you and
ga: • Go ndéanfaidh an SDÉ aon fhiosrúchán riachtanach fút, agus

source: • The ISI to disclose your personal data to the creditors concerned, as required
ga: • Go nochtfaidh SDÉ do shonraí pearsanta do na creidiúnaithe go léir lena mbaineann, de réir mar a theastaíonn

source: In general, you must act in good faith and co-operate fully with the process
ga: Go ginearálta, ní mór duit gníomhú le hintinn mhaith agus comhoibriú go hiomlán leis an bpróiseas

source: The ISI has published detailed information on fees
ga: D’fhoilsigh an ISI faisnéis mhionsonraithe faoi tháillí

source: It has waived its own fees for the 3 debt solutions, originally until the end of 2015, and has extended this waiver to the end of 2017 (pdf)
ga: Rinne sé a tháillí féin a tharscaoileadh i dtaobh na 3 rogha fiachais, go deireadh 2015 i dtosach, agus shín sé an tarscaoileadh seo go dtí deireadh 2017 (pdf)

source: In general, a fee of €500 was payable to the ISI for the issue of a protective certificate – described below. However, in the case of ‘interlocking’ PIAs, which is where two individuals have joint and independent debts on their own, only one fee had to be paid
ga: Ní ann d’aon scála socraithe táillí do PIPanna, ach ceanglaítear orthu a dtáillí agus a gcostais ghaolmhara a shonrú sula gceaptar iad chun gníomhú thar do cheann

source: There is no set scale of fees for PIPs, but they are required to specify their charges and associated costs clearly before being appointed to act on your behalf
ga: I gcás SDPanna ‘comhshnaidhmthe’, áfach, áit a mbíonn comhfhiachais agus fiachais neamhspleácha ag beirt daoine aonair leo féin, ní raibh ach táille amháin le híoc

source: The Personal Insolvency Practitioner sends your application to the ISI
ga: Seolann an Cleachtóir um Dhócmhainneacht Phearsanta d’iarratas chuig an tSeirbhís Dócmhainneachta

source: The ISI checks that all the details are in order and, if so, issues a certificate to that effect and forwards all to the relevant court (the Circuit Court in cases up to €2.5 million and the High Court in larger cases)
ga: Seiceálfaidh SDÉ go bhfuil na sonraí uile in ord agus, má tá siad, eiseoidh siad deimhniú ina leith sin mar aon leis an deimhniú a sheoladh ar aghaidh chuig an gcúirt chuí (an Chúirt Chuarda i gcásanna a mhéid le €2.5 milliún agus an Ard-Chúirt i gcásanna níos mó)

source: The court reviews the documentation and, if all is in order, issues a protective certificate
ga: Déanfaidh an chúirt athbhreithniú ar an gcáipéisíocht go léir, agus, má tá gach aon rud in ord, eiseoidh siad deimhniú cosanta

source: The ISI records the details of the protective certificate on its Register of Protective Certificates
ga: Cuirfidh an tSeirbhís Dócmhainneachta sonraí an deimhnithe cosanta i dtaifead ar a Clár Deimhnithe Cosanta

source: The PIP then notifies each of your creditors of the existence of the protective certificate and your intention to make a proposal for a PIA
ga: Ansin tugann an Cleachtóir um Dhócmhainneacht Phearsanta fógra do gach duine de do chuid creidiúnaithe gurb ann don deimhniú agus go bhfuil sé beartaithe agat togra le haghaidh SDP a dhéanamh

source: The protective certificate will give you 70 days during which your creditors may not:
ga: Tabharfaidh an deimhniú cosanta 70 lá duit, tráth nach féidir le do chreidiúnaithe an méid a leanas a dhéanamh:

source: • Start or continue legal proceedings in respect of the debt
ga: • Tús a chur le himeachtaí dlí maidir leis an bhfiachas nó leanúint leis na himeachtaí siúd

source: • Take or continue any steps to enforce a judgment or contact you about the debt unless you agree to this
ga: • Dul i mbun aon bhirt chun breithiúnas a fhorfheidhmiú nó leanúint leis na bearta siúd nó teagmháil a dhéanamh leat faoin bhfiachas mura gcomhaontaíonn tú leis seo

source: • Start or continue bankruptcy proceedings against you
ga: • Tús a chur le himeachtaí féimheachta i do leith nó leanúint leis na himeachtaí siúd

source: The court may extend the period of the protective certificate by a further 40 days if it is satisfied that:
ga: Féadfaidh an chúirt tréimhse an deimhnithe cosanta a shíneadh le 40 lá breise má tá siad sásta faoin méid a leanas:

source: • You and the PIP have acted in good faith and with reasonable expedition, and
ga: • Ghníomhaigh tú féin agus an Cleachtóir um Dhócmhainneacht Phearsanta le hintinn mhaith agus le heachtra réasúnta, agus

source: • It is likely that, if the extension is granted, a proposal for a PIA will be made that is likely to be accepted by the creditors and successfully completed by you
ga: • Gur dócha, má dheonaítear an síneadh, go ndéanfar togra do SDP ar dócha go nglacfaidh na creidiúnaithe leis agus go gcomhlíonfaidh tú go rathúil é

source: A creditor may apply to the court for an order directing that the protective certificate not apply to him or her
ga: Féadfaidh creidiúnaí iarratas a dhéanamh ar an gcúirt a ordaíonn nach mbainfidh an deimhniú cosanta leis nó léi

source: The court will grant this order only if satisfied that failing to give it would cause irreparable loss to the creditor that would not otherwise occur and that no other creditor to whom notice of the protective certificate has been given would be unfairly prejudiced
ga: Ní dheonóidh an chúirt an t-ordú seo ach amháin má tá siad sásta go mbeadh an creidiúnaí thíos le caillteanas dóréitithe dá bharr, nach dtarlódh murach sin, agus nach ndéanfar difear éagórach d’aon chreidiúnaí eile ar tugadh fógra dóibh faoin deimhniú cosanta

source: Once the protective certificate has been granted, your PIP must invite the relevant creditors to make proposals about the manner in which the debts might be dealt with as part of a PIA
ga: A luaithe a dheonaítear an deimhniú cosanta, ní mór do do CDP iarraidh ar na creidiúnaithe cuí tograí a dhéanamh faoin mbealach inar féidir déileáil le fiachas mar chuid de SDP

source: The creditors must be given your Prescribed Financial Statement
ga: Ní mór do Ráiteas Forordaithe Airgeadais a thabhairt do na creidiúnaithe

source: The PIA must provide for the way in which security held by your creditors is treated
ga: Ní mór don SDP foráil a dhéanamh don bhealach ina gcaitear le hurrús atá á choimeád ag do chreidiúnaithe

source: Unless they agree otherwise, they may get the full value of their security or the full amount that you owe them if the security (such as a second property) is sold
ga: Mura gcomhaontaíonn do chreidiúnaithe ar a mhalairt, féadfaidh said luach iomlán a n-urrúis a fháil, nó an tsuim iomlán atá le híoc agat leo (ar nós an dara maoin) má dhíoltar an t-urrús

source: When formulating the proposal for a PIA, the PIP will ensure, as far as is reasonably practicable, that you are not required to sell or move out of your principal private residence (your home)
ga: Nuair a bhíonn an togra don SDP á chur i dtoll a chéile, cinnteoidh an CDP, a fhad agus is indéanta go réasúnta, nach gá duit bogadh amach ó do phríomháit chónaithe phríobháideach (do theach)

source: If you wish to move out, or if the PIP believes that the running costs of staying in your home are disproportionately large, the PIA may provide for you to move out of it
ga: Más mian leat bogadh amach, nó má chreideann an CDP go bhfuil na costais reatha atá i gceist agus tú ag fanacht i do theach as cuimse, féadfaidh an SDP a fhoráil go mbogann tú amach uaidh

source: When you have consented to the proposal for a PIA that has been formulated by your PIP, the PIP must call a creditors’ meeting
ga: Nuair a thug tú toiliú don togra do SDP a chruthaigh do CDP, ní mór don CDP cruinniú creidiúnaithe a thionól

source: If there is only one creditor, he or she may write to the PIP indicating agreement or rejection
ga: Mura bhfuil ach creidiúnaí amháin ann, féadfaidh é/í scríobh chuig an CDP agus comhaontú nó diúltú a chur in iúl

source: The creditors vote on whether or not to accept the proposed arrangement
ga: Caitheann na creidiúnaithe vóta ar cibé acu an nglacfaidh nó nach nglacfaidh siad leis an socrú beartaithe

source: Each vote is proportional to the amount of debt owed to that creditor
ga: Tá gach vóta i gcomhréir leis an méid fiachais atá le híoc leis an gcreidiúnaí sin

source: Creditors representing 65% or more of the value of the total debt – both secured and unsecured – must vote in favour, for the arrangement to be accepted
ga: Ní mór do chreidiúnaithe a léiríonn 65% nó níos mó de luach an fhiachais iomláin – idir fhiachas faoi urrús agus gan urrús – vótáil i bhfabhar, go nglacfar an socrú

source: In addition, over 50% of your secured creditors and 50% of unsecured creditors must vote in favour
ga: Anuas air sin, ní mór go gcaithfidh breis agus 50% de do chuid creidiúnaithe faoi urrús agus 50% de do chuid creidiúnaithe gan urrús ina fhabhar

source: Under the original legislation, if the creditors reject the proposal, the protective certificate ceases to have effect and the PIA process comes to an end
ga: Faoin reachtaíocht bhunúil, má dhiúltaíonn na creidiúnaithe an togra, cuirtear deireadh le héifeacht an deimhnithe cosanta agus cuirtear deireadh leis an bpróiseas SDP

source: However, the Personal Insolvency (Amendment) Act 2015 now provides for court review where a mortgage lender rejects the borrower’s personal insolvency proposal
ga: Foráiltear anois san Acht um Dhócmhainneacht Phearsanta (Leasú), 2015 d’athbhreithniú cúirte sa chás go ndiúltaíonn iasachtóir morgáiste togra um dhócmhainneacht phearsanta an iasachtóra

source: Read more detail about this process in the ISI’s press release (pdf)
ga: Is féidir leat níos mó sonraí a léamh faoin bpróiseas seo i bpreaseisiúint an ISI (pdf)

source: If the proposal is accepted, the PIP must inform the Insolvency Service and tell creditors of their right to object to the relevant court - (the Circuit Court in cases up to €2.5 million and the High Court in larger cases)
ga: Má ghlactar leis an togra, ní mór don CDP an tSeirbhís Dócmhainneachta a chur ar an eolas agus an ceart atá ag na creidiúnaithe a chur in iúl chun cur i gcoinne na cúirte cuí – (an Chúirt Chuarda i gcásanna a mhéid le €2.5 milliún agus an Ard-Chúirt i gcásanna níos mó)

source: The Insolvency Service notifies the court
ga: Tugann an tSeirbhís Dócmhainneachta fógra don chúirt

source: If there is any objection, the protective certificate remains in place until the matter is decided
ga: Má bhíonn aon aighneacht ann, fanann an deimhniú cosanta i bhfeidhm go dtí go ndéantar cinneadh ar an ábhar

source: The grounds on which an objection to the coming into effect of the Personal Insolvency Arrangement may be made are limited and include the following:
ga: Tá na bunúis ar ar féidir aighneacht a dhéanamh i leith teacht i bhfeidhm Socrú um Dhócmhainneacht Phearsanta, faoi theorainn agus áirítear leo an méid a leanas:

source: • You arranged your affairs in the previous 2 years primarily with a view to becoming eligible for a Debt Settlement Arrangement or a Personal Insolvency Arrangement
ga: • Shocraigh tú féin do chuid gnóthaí sna 2 bhliain roimhe seo, féachaint le bheith incháilithe do Shocrú um Réiteach Fiachais nó Socrú um Dhócmhainneacht Phearsanta

source: • The procedural requirements were not followed
ga: • Níor leanadh na ceanglais nós imeachta

source: • A material inaccuracy or omission exists in your Prescribed Financial Statement that causes a material detriment to the creditor
ga: • Is ann do mhíchruinneas nó d’easnamh i do Ráiteas Forordaithe Airgeadais a bhíonn ina chúis le dochar ábhartha a dhéanamh don chreidiúnaí

source: • You did not meet the requirements when the arrangement was proposed
ga: • Níor chomhlíon tú na ceanglais nuair a beartaíodh an socrú

source: • The arrangement unfairly prejudices the interests of a creditor
ga: • Déanann an socrú difear éagórach do leas an chreidiúnaí

source: • You have committed an offence under the Personal Insolvency legislation
ga: • Rinne tú cion faoin reachtaíocht um Dhócmhainneacht Phearsanta

source: • You have entered into a transaction at an undervalue or given a preference to a person in the previous three years that has materially contributed to your inability to pay your debts
ga: • D’iontráil tú in idirbheart ar saorluach nó roghnaigh tú duine sna trí bliana roimhe seo a chuir go hábhartha leis na deacrachtaí atá agat chun íoc as do chuid fiachais

source: Issue of a Personal Insolvency Arrangement
ga: Socrú um Dhócmhainneacht Phearsanta a eisiúint

source: If there is no objection or an objection is not upheld, the court approves the Personal Insolvency Arrangement if satisfied that all the conditions have been met
ga: Murab ann d’aon aighneacht nó mura seastar le haon aighneacht, faomhann an chúirt an Socrú um Dhócmhainneacht Phearsanta, má tá siad sásta gur comhlíonadh na coinníollacha go léir

source: The Insolvency Service records the PIA in its Register of Personal Insolvency Arrangements and it comes into effect
ga: Déanann an tSeirbhís Dócmhainneachta an SDP a chur i dtaifead ina Clár Socruithe um Dhócmhainneacht Phearsanta agus tagann sé i bhfeidhm

source: Deferring Local Property Tax
ga: Cáin Mhaoine Áitiúil a Chur Siar

source: Once you have entered into a Personal Insolvency Arrangement, you can apply for a deferral of Local Property Tax (LPT) while the PIA is in place
ga: A luaithe a d’iontráil tú i Socrú um Dhócmhainneacht Phearsanta, is féidir leat iarratas a dhéanamh ar Cháin Mhaoine Áitiúil (CMÁ) a chur siar fad a bhíonn an SDP i bhfeidhm

source: Read more on revenue.ie
ga: Is féidir leat níos mó a léamh ar revenue.ie

source: Varying a Personal Insolvency Arrangement
ga: Socrú um Dhócmhainneacht Phearsanta a éagsúlú

source: Personal Insolvency Arrangements may be varied – the procedures are similar to those for setting up the arrangement
ga: Féadtar Socruithe um Dhócmhainneacht Phearsanta a éagsúlú – is cosúil na nósanna imeachta leo siúd chun an socrú a chur ar bun

source: A creditor or a PIP may apply to the court at any time during the Personal Insolvency Arrangement to have it ended
ga: Féadfaidh creidiúnaí nó CDP iarratas a dhéanamh ar an gcúirt aon tráth le linn an tSocraithe um Dhócmhainneacht Phearsanta go gcuirfear deireadh leis

source: The grounds for such an application are limited and include the following:
ga: Beidh na bunúis le haghaidh iarratais den sórt sin teoranta agus áireofar leo an méid a leanas:

source: • Your Prescribed Financial Statement has a material inaccuracy or omission that causes a material detriment to the creditor
ga: • Is ann do mhíchruinneas nó d’easnamh ábhartha i do Ráiteas Forordaithe Airgeadais atá ina chúis le dochar ábhartha a dhéanamh don chreidiúnaí

source: • You did not meet the requirements when you started the process
ga: • Níor chomhlíon tú na ceanglais nuair a thosaigh an próiseas

source: • You did not comply with the terms of the Personal Insolvency Arrangement
ga: • Níor chloí tú le téarmaí an tSocraithe um Dhócmhainneacht Phearsanta

source: • You have committed an offence under the personal insolvency legislation since the arrangement came into effect
ga: • Rinne tú cion faoin reachtaíocht um Dhócmhainneacht Phearsanta ó tháinig an socrú i bhfeidhm

source: • You are in arrears with your payments for a period of not less than 3 months
ga: • Tá riaráistí cruthaithe agat le d’íocaíochtaí ar feadh tréimhse nach lú ná 3 mhí

source: The full list of grounds is in Section 122 of the Personal Insolvency Act 2012
ga: Tá an liosta iomlán bunús le fáil in Alt 122 den Acht um Dhócmhainneacht Phearsanta 2012

source: If you are in arrears with your payments for more than 6 months, the PIA will be deemed to have failed
ga: Má tá riaráistí cruthaithe agat le d’íocaíochtaí ar feadh tréimhse níos mó ná 6 mhí, measfar gur theip ar an SDP

source: This will be recorded in the Register of Personal Insolvency Arrangements
ga: Cuirfear seo i dtaifead sa Chlár Socruithe um Dhócmhainneacht Phearsanta

source: Ending of a Personal Insolvency Arrangement
ga: Deireadh a chur le Socrú um Dhócmhainneacht Phearsanta

source: If the arrangement ends other than by successful completion, you will become fully liable for all specified debts, inclusive of arrears, charges and interest that have accrued during the PIA period, less any payments made by you during that time, unless the terms of the PIA specify, or the court has ordered, otherwise
ga: Má chuirtear deireadh leis an socrú, seachas deireadh tar éis críochnú rathúil, beidh tú go hiomlán faoi dhliteanas íoc as an bhfiachas iomlán a shonraítear, mar aon le riaráistí, muirir agus ús a cruthaíodh le linn na tréimhse SDP, lúide aon íocaíochtaí a rinne tú i dturas an ama sin, murar ordaigh téarmaí an SDP, an chúirt a mhalairt go sonrach

source: If the arrangement is successfully completed, you are discharged from the unsecured debts covered by the arrangement
ga: Má chríochnaítear an socrú go rathúil, díscaoiltear thú ón bhfiachas gan urrús atá cumhdaithe ag an socrú

source: You will not be discharged from the secured debts, except where this was explicitly provided for in the PIA
ga: Ní dhíscaoilfear thú ón bhfiachas gan urrús, seachas sa chás go ndearnadh foráil shonrach dó seo sa SDP

source: The successful completion is recorded on the Register of Personal Insolvency Arrangements
ga: Cuirtear an críochnú rathúil i dtaifead sa Chlár Socruithe um Dhócmhainneacht Phearsanta

source: Your application for a Personal Insolvency Arrangement must be made through a Personal Insolvency Practitioner (PIP)
ga: Ní mór d’iarratas ar Shocrú um Dhócmhainneacht Phearsanta a dhéanamh trí Chleachtóir um Dhócmhainneacht Phearsanta

source: You can choose one from the Register of Personal Insolvency Practitioners that is published by the ISI
ga: Is féidir CDP a roghnú ón gClár CDPanna a d'fhoilsigh an ISI

source: Further information is available from the ISI’s helpline 0761 06 4200 (Monday to Friday, 9 am to 6 pm) and from its main website isi.gov.ie, as well as its website backontrack.ie for people who are struggling with debt
ga: Is féidir tuilleadh eolais a fháil ó líne chabhrach an ISI 0761 06 4200 (Luan go hAoine, 9 rn go 6 in), ón láithreán isi.gov.ie agus ón láithrean backontrack.ie, atá dírithe ar dhaoine a bhfuil fadhbanna fiachais acu
